ninety_nine_cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    if cat = Cat.create(cat_params)

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "birth_date" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["description", "first cat in db AND first cat to be updated"], ["birth_date", "2000-07-01"], ["updated_at", "2019-04-02 23:49:14.686065"], ["id", 1]]
---
  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update(cat_params)

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 2]]
---
  def destroy
    @cat = Cat.find_by(id: params[:id])
    fail
    if @cat.destroy(cat_params)